XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A31A_DFP.pdsc
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.driver.lpuart_edma, device_id=K32L2A31xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart_edma, device_id=K32L2A31xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require condition="device_id.K32L2A31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.clock, device.K32L2A31A_CMSIS, device=K32L2A31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.clock, device.K32L2A31A_CMSIS, device=K32L2A31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2A31A_header"/>
      <require condition="device.K32L2A31A.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.device_id=K32L2A31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dac.condition_id">
      <require condition="allOf.device_id=K32L2A31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.device_id=K32L2A31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.device_id=K32L2A31xxxxA, driver.common, driver.dmamux.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2A31xxxxA, driver.common, driver.dmamux.internal_condition">
      <require condition="device_id.K32L2A31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device=K32L2A31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.device_id=K32L2A31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexio_camera.condition_id">
      <require condition="allOf.driver.flexio, device_id=K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=K32L2A31xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_camera_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_camera, device_id=K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_camera, device_id=K32L2A31xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_camera"/>
      <require condition="device_id.K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2A31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device=K32L2A31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device.K32L2A31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2A31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_i2s, device_id=K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_i2s, device_id=K32L2A31xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device_id.K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_mculcd, device_id=K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_mculcd, device_id=K32L2A31xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require condition="device_id.K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2A31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.driver.edma, driver.flexio_spi, device_id=K32L2A31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma, driver.flexio_spi, device_id=K32L2A31xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device_id.K32L2A31xxxxA.internal_condition"/>
    </condition>
