XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A31A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.0.2" condition="driver.dac.condition_id">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_dac.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_dac.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.0" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.3" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash" Cversion="3.1.3" condition="driver.flash.condition_id">
      <description>Flash Driver</description>
      <files>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_ftfx_adapter.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_ftfx_utilities.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_ftfx_features.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_ftfx_controller.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_ftfx_controller.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_ftfx_flash.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_ftfx_flash.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_ftfx_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_ftfx_cache.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_ftfx_flexnvm.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_ftfx_flexnvm.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flash.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.2.2" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_camera" Cversion="2.1.3" condition="driver.flexio_camera.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_camera.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_camera.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_camera_edma" Cversion="2.1.3" condition="driver.flexio_camera_edma.condition_id">
      <description>FLEXIO CAMERA EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_camera_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_camera_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.5.0" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s" Cversion="2.2.0" condition="driver.flexio_i2s.condition_id">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_i2s.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_i2s.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s_edma" Cversion="2.1.7" condition="driver.flexio_i2s_edma.condition_id">
      <description>FLEXIO I2S EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_i2s_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_i2s_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd" Cversion="2.1.0" condition="driver.flexio_mculcd.condition_id">
      <description>FLEXIO MCULCD Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_mculcd.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_mculcd.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
