XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2A31A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd_edma" Cversion="2.0.5" condition="driver.flexio_mculcd_edma.condition_id">
      <description>FLEXIO MCULCD EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_mculcd_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_mculcd_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.3.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi_edma" Cversion="2.3.0" condition="driver.flexio_spi_edma.condition_id">
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_spi_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_spi_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart" Cversion="2.5.0" condition="driver.flexio_uart.condition_id">
      <description>FLEXIO UART Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_uart.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_uart.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart_edma" Cversion="2.4.1" condition="driver.flexio_uart_edma.condition_id">
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_flexio_uart_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_flexio_uart_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft5406/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="driver.ft6x06.condition_id">
      <description>Driver ft6x06</description>
      <files>
        <file category="header" name="components/ft6x06/fsl_ft6x06.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft6x06/fsl_ft6x06.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft6x06/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.7.3" condition="driver.gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/ili9341/fsl_ili9341.h" projectpath="lcd"/>
        <file category="sourceC" name="components/ili9341/fsl_ili9341.c" projectpath="lcd"/>
        <file category="include" name="components/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="intmux" Cversion="2.0.4" condition="driver.intmux.condition_id">
      <description>INTMUX Driver</description>
      <files>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_intmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_intmux.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="llwu" Cversion="2.0.5" condition="driver.llwu.condition_id">
      <description>LLWU Driver</description>
      <files>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_llwu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_llwu.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.5.2" condition="driver.lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.4.1" condition="driver.lpi2c_edma.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpit" Cversion="2.1.1" condition="driver.lpit.condition_id">
      <description>LPIT Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2A31A/drivers/fsl_lpit.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2A31A/drivers/fsl_lpit.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2A31A/drivers/"/>
      </files>
    </component>
